src/Catalogs/ИТСервисы_ЛицензииПО/ИТСервисы_ЛицензииПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ЛицензииПО</name>
  <attributes>
    <name>ПрограммноеОбеспечение</name>
    <type>
      <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛицензирования</name>
    <type>
      <types>EnumRef.ИТСервисы_ТипыЛицензирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вендор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ИТСервисы_СостоянияЛицензий/ИТСервисы_СостоянияЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СостоянияЛицензий</name>
  <resources>
    <name>ДнейДоОкончания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ИТСервисы_ЛицензииПО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИТСервисы_ЛицензииПО/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, РежимЗаписи, ЗаписьОперативная)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		СекундВДне = 86400;
		НаборЗаписей = РегистрыСведений.ИТСервисы_СостоянияЛицензий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Лицензия.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		
		ДнейДоОкончания = (ДатаОкончания - ТекущаяДатаСеанса()) / СекундВДне;
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Лицензия = Ссылка;
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			ЗаписьРегистра = НаборЗаписей[0];
			ЗаписьРегистра.ДнейДоОкончания = ДнейДоОкончания;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
